package practise;

/**
 * 僅使用一變數 a ，設定初始值為 3 ，
 * 之後利用 ++ -- += -= 的方式 (各用一次)
 * 輸出以下結果(不用順序)
 * 2
 * 5
 * 6
 * 1
 */

public class Exercise_2_2號李旻恩 {
    public static void main(String[] args) {
        // 初始值設定
        int a = 3;

        // -----------------------------------------------
        // 計算 [--] (3-1=2)
        a--; // --a;
        // 輸出
        System.out.println(a); // 2

        // -----------------------------------------------
        // 計算 [+=] (2+3=5)
        a += 3;
        // 輸出
        System.out.println(a); // 5

        // -----------------------------------------------
        // 計算 [++] (5+1=6)
        a++; // ++a;
        // 輸出
        System.out.println(a); // 6

        // -----------------------------------------------
        // 計算 [-=] (6-5=1)
        a -= 5;
        // 輸出
        System.out.println(a); // 5

    }
}
